Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# Set_diagnostics_hexView_overlay
source: Show rendering diagnostics in the Hex view
ar: إظهار تشخيصات العرض في عرض Hex
cs: Zobrazit diagnostiku vykreslování v zobrazení Hex
de: Darstellungsdiagnose in der Hex-Ansicht anzeigen
el: Εμφάνιση διαγνωστικών απόδοσης στην προβολή Hex
es: Mostrar el diagnóstico de representación en la vista Hex
fa: نمایش عیب‌یابی رندر در نمای Hex
fr: Afficher le diagnostic du rendu dans la vue Hex
hu: Megjelenítési diagnosztika a Hex nézetben
id: Tampilkan diagnostik rendering di tampilan Hex
it: Mostra la diagnostica del rendering nella vista Hex
ja: Hex ビューに描画の診断を表示
ko: Hex 보기에 렌더링 진단 표시
pl: Pokazuj diagnostykę renderowania w widoku Hex
pt: Mostrar diagnóstico de renderização na exibição Hex
ro: Afișare diagnosticare randare în vizualizarea Hex
ru: Показывать диагностику отрисовки в представлении Hex
th: แสดงการวินิจฉัยการเรนเดอร์ในมุมมอง Hex
tr: Hex görünümünde çizim tanılamasını göster
uk: Показувати діагностику відтворення в поданні Hex
vi: Hiện thông tin chẩn đoán kết xuất trong khung xem Hex
zh_hans: 在 Hex 视图中显示渲染诊断信息
zh_hant: 在 Hex 檢視中顯示轉譯診斷

# SetDesc_diagnostics_hexView_overlay
source: Shows a small table in the top right of the Hex view with the frame rate, drawing time and frames that waited for data. For investigating performance.
ar: إظهار جدول صغير في أعلى يمين عرض Hex يتضمن معدل الإطارات ووقت الرسم والإطارات التي انتظرت البيانات. لفحص الأداء.
cs: Zobrazí v pravém horním rohu zobrazení Hex malou tabulku se snímkovou frekvencí, dobou vykreslení a snímky, které čekaly na data. Slouží ke zkoumání výkonu.
de: Zeigt oben rechts in der Hex-Ansicht eine kleine Tabelle mit Bildrate, Zeichenzeit und Frames, die auf Daten gewartet haben. Zur Leistungsanalyse.
el: Εμφανίζει έναν μικρό πίνακα επάνω δεξιά στην προβολή Hex με τον ρυθμό καρέ, τον χρόνο σχεδίασης και τα καρέ που περίμεναν δεδομένα. Για τη διερεύνηση των επιδόσεων.
es: Muestra en la esquina superior derecha de la vista Hex una pequeña tabla con la velocidad de fotogramas, el tiempo de dibujo y los fotogramas que esperaron datos. Para investigar el rendimiento.
fa: جدول کوچکی در گوشهٔ بالا سمت راست نمای Hex با نرخ فریم، زمان رسم و فریم‌هایی که منتظر داده ماندند نمایش می‌دهد. برای بررسی کارایی.
fr: Affiche en haut à droite de la vue Hex un petit tableau indiquant la fréquence d'images, le temps de dessin et les images ayant attendu des données. Pour analyser les performances.
hu: Kis táblázat a Hex nézet jobb felső sarkában a képkockasebességgel, a rajzolási idővel és az adatokra váró képkockákkal. Teljesítményvizsgálathoz.
id: Menampilkan tabel kecil di kanan atas tampilan Hex dengan frame rate, waktu menggambar, dan frame yang menunggu data. Untuk menyelidiki performa.
it: Mostra una piccola tabella in alto a destra nella vista Hex con la frequenza dei fotogrammi, il tempo di disegno e i fotogrammi che hanno atteso i dati. Per analizzare le prestazioni.
ja: Hex ビューの右上に、フレームレート・描画時間・読み込み待ちのフレーム数を示す小さな表を表示します。性能の調査用です。
ko: Hex 보기 오른쪽 위에 프레임 속도, 그리기 시간, 데이터를 기다린 프레임 수를 보여 주는 작은 표를 표시합니다. 성능 조사용입니다.
pl: Pokazuje małą tabelę w prawym górnym rogu widoku Hex z liczbą klatek na sekundę, czasem rysowania i klatkami oczekującymi na dane. Do badania wydajności.
pt: Mostra uma pequena tabela no canto superior direito da exibição Hex com a taxa de quadros, o tempo de desenho e os quadros que aguardaram dados. Para investigar o desempenho.
ro: Afișează un mic tabel în dreapta sus a vizualizării Hex, cu rata de cadre, timpul de desenare și cadrele care au așteptat date. Pentru investigarea performanței.
ru: Показывает в правом верхнем углу представления Hex небольшую таблицу с частотой кадров, временем отрисовки и кадрами, ожидавшими данных. Для анализа производительности.
th: แสดงตารางขนาดเล็กที่มุมขวาบนของมุมมอง Hex พร้อมอัตราเฟรม เวลาในการวาด และจำนวนเฟรมที่รอข้อมูล สำหรับตรวจสอบประสิทธิภาพ
tr: Hex görünümünün sağ üst köşesinde kare hızını, çizim süresini ve veri bekleyen kareleri içeren küçük bir tablo gösterir. Performans incelemesi içindir.
uk: Показує в правому верхньому куті подання Hex невелику таблицю з частотою кадрів, часом малювання й кадрами, що очікували на дані. Для дослідження продуктивності.
vi: Hiện một bảng nhỏ ở góc trên bên phải khung xem Hex với tốc độ khung hình, thời gian vẽ và số khung hình phải chờ dữ liệu. Dùng để điều tra hiệu năng.
zh_hans: 在 Hex 视图右上角显示一个小表格，其中包含帧速率、绘制时间以及等待数据的帧数。用于调查性能。
zh_hant: 在 Hex 檢視右上角顯示小表格，列出畫面播放速率、繪製時間和等待資料的畫面數。用於調查效能。

# Set_view_scroll_fixedOffsetColumn
source: Keep the offset column fixed
ar: تثبيت عمود الإزاحة
cs: Ukotvit sloupec posunu
de: Offset-Spalte fixieren
el: Σταθερή στήλη μετατόπισης
es: Mantener fija la columna de desplazamiento
fa: ثابت نگه‌داشتن ستون آفست
fr: Figer la colonne des décalages
hu: Eltolás oszlop rögzítése
id: Kunci kolom offset
it: Mantieni fissa la colonna offset
ja: オフセット列を固定
ko: 오프셋 열 고정
pl: Zablokuj kolumnę przesunięcia
pt: Manter a coluna de deslocamento fixa
ro: Coloana deplasament rămâne fixă
ru: Закрепить столбец смещений
th: ตรึงคอลัมน์ออฟเซ็ตไว้
tr: Ofset sütununu sabit tut
uk: Закріпити стовпець зміщення
vi: Cố định cột độ lệch
zh_hans: 固定偏移量列
zh_hant: 固定位移欄

# SetDesc_view_scroll_fixedOffsetColumn
source: When scrolling horizontally, the offset column stays at the left edge. Turn off to scroll it together with the Hex and text columns.
ar: عند التمرير أفقياً، يبقى عمود الإزاحة عند الحافة. أوقف هذا الخيار لتمريره مع عمود Hex وعمود النص.
cs: Při vodorovném posouvání zůstane sloupec posunu u levého okraje. Po vypnutí se posouvá spolu se sloupcem Hex a textovým sloupcem.
de: Beim horizontalen Scrollen bleibt die Offset-Spalte am linken Rand. Deaktivieren, um sie zusammen mit der Hex- und der Textspalte zu scrollen.
el: Κατά την οριζόντια κύλιση, η στήλη μετατόπισης παραμένει στο αριστερό άκρο. Απενεργοποιήστε τη ρύθμιση για να κυλίεται μαζί με τη στήλη Hex και τη στήλη κειμένου.
es: Al desplazarse horizontalmente, la columna de desplazamiento permanece en el borde izquierdo. Desactívalo para que se desplace junto con las columnas Hex y de texto.
fa: هنگام پیمایش افقی، ستون آفست در لبهٔ چپ باقی می‌ماند. برای پیمایش آن همراه با ستون Hex و ستون متن، خاموش کنید.
fr: Lors du défilement horizontal, la colonne des décalages reste au bord gauche. Désactivez pour la faire défiler avec les colonnes Hex et texte.
hu: Vízszintes görgetéskor az eltolás oszlop a bal szélen marad. Kikapcsolva együtt görgetődik a Hex oszloppal és a szövegoszloppal.
id: Saat menggulir secara horizontal, kolom offset tetap di tepi kiri. Nonaktifkan untuk menggulirnya bersama kolom Hex dan kolom teks.
it: Durante lo scorrimento orizzontale, la colonna offset rimane sul bordo sinistro. Disattiva per scorrerla insieme alle colonne Hex e testo.
ja: 横にスクロールしても、オフセット列を左端に残します。オフにすると、Hex 列・テキスト列と一緒にスクロールします。
ko: 가로로 스크롤할 때 오프셋 열이 왼쪽 가장자리에 유지됩니다. 끄면 Hex 열 및 텍스트 열과 함께 스크롤됩니다.
pl: Podczas przewijania w poziomie kolumna przesunięcia pozostaje przy lewej krawędzi. Wyłącz, aby przewijać ją razem z kolumnami Hex i tekstu.
pt: Ao rolar horizontalmente, a coluna de deslocamento permanece na borda esquerda. Desative para rolá-la junto com as colunas Hex e de texto.
ro: La derularea pe orizontală, coloana deplasament rămâne la marginea din stânga. Dezactivați pentru a o derula împreună cu coloanele Hex și text.
ru: При горизонтальной прокрутке столбец смещений остается у левого края. Отключите, чтобы прокручивать его вместе со столбцами Hex и текста.
th: เมื่อเลื่อนในแนวนอน คอลัมน์ออฟเซ็ตจะอยู่ที่ขอบซ้าย ปิดเพื่อให้เลื่อนไปพร้อมกับคอลัมน์ Hex และคอลัมน์ข้อความ
tr: Yatay kaydırırken ofset sütunu sol kenarda kalır. Hex ve metin sütunlarıyla birlikte kaydırmak için kapatın.
uk: Під час горизонтального прокручування стовпець зміщення залишається біля лівого краю. Вимкніть, щоб прокручувати його разом зі стовпцями Hex і тексту.
vi: Khi cuộn ngang, cột độ lệch vẫn ở mép trái. Tắt để cuộn cột này cùng với cột Hex và cột văn bản.
zh_hans: 水平滚动时，偏移量列保持在左边缘。关闭后，它将与 Hex 列和文本列一起滚动。
zh_hant: 水平捲動時，位移欄會保持在左邊緣。關閉後會與 Hex 欄和文字欄一起捲動。

# HexView_Menu_SetReference
source: Set as reference point
ar: التعيين كنقطة مرجعية
cs: Nastavit jako referenční bod
de: Als Bezugspunkt festlegen
el: Ορισμός ως σημείου αναφοράς
es: Usar como punto de referencia
fa: تنظیم به‌عنوان نقطهٔ مرجع
fr: Définir comme point de référence
hu: Beállítás viszonyítási pontként
id: Tetapkan sebagai titik referensi
it: Imposta come punto di riferimento
ja: ここを基準点にする
ko: 기준점으로 설정
pl: Ustaw jako punkt odniesienia
pt: Definir como ponto de referência
ro: Setare ca punct de referință
ru: Сделать опорной точкой
th: ตั้งเป็นจุดอ้างอิง
tr: Referans noktası olarak ayarla
uk: Зробити точкою відліку
vi: Đặt làm điểm tham chiếu
zh_hans: 设为参考点
zh_hant: 設為參考點

# Find_Encoding_Display
source: Match the displayed encoding
ar: مطابقة الترميز المعروض
cs: Podle zobrazeného kódování
de: Angezeigte Codierung verwenden
el: Αντιστοίχιση με την κωδικοποίηση που εμφανίζεται
es: Usar la codificación mostrada
fa: مطابق رمزگذاری نمایش‌داده‌شده
fr: Utiliser l'encodage affiché
hu: A megjelenített kódolás szerint
id: Sesuaikan dengan pengodean yang ditampilkan
it: Usa la codifica visualizzata
ja: 表示中の文字コードに合わせる
ko: 표시된 인코딩에 맞춤
pl: Zgodnie z wyświetlanym kodowaniem
pt: Usar a codificação exibida
ro: Potrivire cu codificarea afișată
ru: Как в отображаемой кодировке
th: ตรงกับการเข้ารหัสที่แสดงอยู่
tr: Görüntülenen kodlamayla eşleştir
uk: Як у поточному кодуванні відображення
vi: Khớp với bảng mã đang hiển thị
zh_hans: 与显示的编码一致
zh_hant: 符合顯示的編碼

# Find_Encoding_DisplayWith
source: Match the displayed encoding ({0})
ar: مطابقة الترميز المعروض ({0})
cs: Podle zobrazeného kódování ({0})
de: Angezeigte Codierung verwenden ({0})
el: Αντιστοίχιση με την κωδικοποίηση που εμφανίζεται ({0})
es: Usar la codificación mostrada ({0})
fa: مطابق رمزگذاری نمایش‌داده‌شده ({0})
fr: Utiliser l'encodage affiché ({0})
hu: A megjelenített kódolás szerint ({0})
id: Sesuaikan dengan pengodean yang ditampilkan ({0})
it: Usa la codifica visualizzata ({0})
ja: 表示中の文字コードに合わせる ({0})
ko: 표시된 인코딩에 맞춤({0})
pl: Zgodnie z wyświetlanym kodowaniem ({0})
pt: Usar a codificação exibida ({0})
ro: Potrivire cu codificarea afișată ({0})
ru: Как в отображаемой кодировке ({0})
th: ตรงกับการเข้ารหัสที่แสดงอยู่ ({0})
tr: Görüntülenen kodlamayla eşleştir ({0})
uk: Як у поточному кодуванні відображення ({0})
vi: Khớp với bảng mã đang hiển thị ({0})
zh_hans: 与显示的编码一致（{0}）
zh_hant: 符合顯示的編碼（{0}）

# Find_AbortedUnreadable
source: Search stopped: the data at {0} can't be read.
ar: توقف البحث: تتعذّر قراءة البيانات عند {0}.
cs: Hledání bylo zastaveno: data na {0} nelze přečíst.
de: Suche abgebrochen: Die Daten bei {0} können nicht gelesen werden.
el: Η αναζήτηση διακόπηκε: δεν είναι δυνατή η ανάγνωση των δεδομένων στο {0}.
es: Búsqueda detenida: no se pueden leer los datos en {0}.
fa: جستجو متوقف شد: داده در {0} قابل خواندن نیست.
fr: Recherche arrêtée : les données à {0} ne peuvent pas être lues.
hu: A keresés leállt: a(z) {0} pozíción lévő adatok nem olvashatók.
id: Pencarian dihentikan: data di {0} tidak dapat dibaca.
it: Ricerca interrotta: impossibile leggere i dati in {0}.
ja: {0} のデータを読み込めないため、検索を中止しました。
ko: 검색이 중지되었습니다. {0}의 데이터를 읽을 수 없습니다.
pl: Wyszukiwanie zatrzymane: nie można odczytać danych pod {0}.
pt: Pesquisa interrompida: não é possível ler os dados em {0}.
ro: Căutarea s-a oprit: datele de la {0} nu pot fi citite.
ru: Поиск остановлен: не удается прочитать данные в позиции {0}.
th: หยุดการค้นหาแล้ว: ไม่สามารถอ่านข้อมูลที่ {0} ได้
tr: Arama durduruldu: {0} konumundaki veriler okunamıyor.
uk: Пошук зупинено: не вдається прочитати дані в позиції {0}.
vi: Đã dừng tìm kiếm: không thể đọc dữ liệu tại {0}.
zh_hans: 搜索已停止：无法读取 {0} 处的数据。
zh_hant: 搜尋已停止：無法讀取 {0} 處的資料。

# Find_Unreadable_Ask
source: Can't read {1} bytes at {0} ({2}). Skip the unreadable data and continue searching?
ar: تتعذّر قراءة {1} بايت عند {0} ({2}). هل تريد تخطي البيانات غير القابلة للقراءة ومتابعة البحث؟
cs: Nelze přečíst bajty na {0} (počet: {1}, {2}). Přeskočit nečitelná data a pokračovat v hledání?
de: {1} Bytes bei {0} können nicht gelesen werden ({2}). Nicht lesbare Daten überspringen und weitersuchen?
el: Δεν είναι δυνατή η ανάγνωση {1} byte στο {0} ({2}). Να γίνει παράλειψη των δεδομένων που δεν διαβάζονται και να συνεχιστεί η αναζήτηση;
es: No se pueden leer {1} bytes en {0} ({2}). ¿Omitir los datos ilegibles y seguir buscando?
fa: خواندن {1} بایت در {0} ممکن نیست ({2}). دادهٔ غیرقابل خواندن رد شود و جستجو ادامه یابد؟
fr: Impossible de lire {1} octets à {0} ({2}). Ignorer les données illisibles et poursuivre la recherche ?
hu: Nem olvasható {1} bájt itt: {0} ({2}). Kihagyja az olvashatatlan adatokat, és folytatja a keresést?
id: Tidak dapat membaca {1} byte di {0} ({2}). Lewati data yang tidak dapat dibaca dan lanjutkan pencarian?
it: Impossibile leggere {1} byte in {0} ({2}). Ignorare i dati non leggibili e continuare la ricerca?
ja: {0} から {1} バイトを読み込めません ({2})。読み込めない部分を飛ばして検索を続けますか?
ko: {0}에서 {1}바이트를 읽을 수 없습니다({2}). 읽을 수 없는 데이터를 건너뛰고 검색을 계속하시겠습니까?
pl: Nie można odczytać {1} B pod {0} ({2}). Czy pominąć nieczytelne dane i kontynuować wyszukiwanie?
pt: Não é possível ler {1} bytes em {0} ({2}). Pular os dados ilegíveis e continuar pesquisando?
ro: Nu se pot citi {1} octeți de la {0} ({2}). Omiteți datele care nu pot fi citite și continuați căutarea?
ru: Не удается прочитать {1} байт в позиции {0} ({2}). Пропустить нечитаемые данные и продолжить поиск?
th: ไม่สามารถอ่าน {1} ไบต์ที่ {0} ได้ ({2}) ข้ามข้อมูลที่อ่านไม่ได้และค้นหาต่อหรือไม่
tr: {0} konumundaki {1} bayt okunamıyor ({2}). Okunamayan veriler atlanıp aramaya devam edilsin mi?
uk: Не вдається прочитати {1} байтів у позиції {0} ({2}). Пропустити непрочитувані дані й продовжити пошук?
vi: Không thể đọc {1} byte tại {0} ({2}). Bỏ qua dữ liệu không đọc được và tiếp tục tìm kiếm?
zh_hans: 无法读取 {0} 处的 {1} 字节（{2}）。是否跳过无法读取的数据并继续搜索？
zh_hant: 無法讀取 {0} 處的 {1} 個位元組（{2}）。要略過無法讀取的資料並繼續搜尋嗎？

# Find_Unreadable_Skip
source: Skip and continue
ar: التخطي والمتابعة
cs: Přeskočit a pokračovat
de: Überspringen und fortsetzen
el: Παράλειψη και συνέχεια
es: Omitir y continuar
fa: رد کردن و ادامه
fr: Ignorer et continuer
hu: Kihagyás és folytatás
id: Lewati dan lanjutkan
it: Ignora e continua
ja: 飛ばして続ける
ko: 건너뛰고 계속
pl: Pomiń i kontynuuj
pt: Pular e continuar
ro: Omitere și continuare
ru: Пропустить и продолжить
th: ข้ามและดำเนินการต่อ
tr: Atla ve devam et
uk: Пропустити й продовжити
vi: Bỏ qua và tiếp tục
zh_hans: 跳过并继续
zh_hant: 略過並繼續

# Find_Unreadable_Abort
source: Stop searching
ar: إيقاف البحث
cs: Zastavit hledání
de: Suche abbrechen
el: Διακοπή αναζήτησης
es: Detener la búsqueda
fa: توقف جستجو
fr: Arrêter la recherche
hu: Keresés leállítása
id: Hentikan pencarian
it: Interrompi la ricerca
ja: 検索を中止する
ko: 검색 중지
pl: Zatrzymaj wyszukiwanie
pt: Parar a pesquisa
ro: Oprire căutare
ru: Остановить поиск
th: หยุดการค้นหา
tr: Aramayı durdur
uk: Зупинити пошук
vi: Dừng tìm kiếm
zh_hans: 停止搜索
zh_hant: 停止搜尋

# Find_Unreadable_Reason_Unallocated
source: unallocated
ar: غير مخصص
cs: nepřiděleno
de: nicht zugeordnet
el: δεν έχει εκχωρηθεί
es: no asignado
fa: تخصیص‌نیافته
fr: non alloué
hu: nincs lefoglalva
id: tidak dialokasikan
it: non allocato
ja: 未割り当て
ko: 할당되지 않음
pl: nieprzydzielone
pt: não alocado
ro: nealocat
ru: не выделено
th: ไม่ได้จัดสรร
tr: ayrılmamış
uk: не виділено
vi: chưa được cấp phát
zh_hans: 未分配
zh_hant: 未配置

# Find_Unreadable_Reason_AccessDenied
source: access denied
ar: تم رفض الوصول
cs: přístup odepřen
de: Zugriff verweigert
el: δεν επιτρέπεται η πρόσβαση
es: acceso denegado
fa: دسترسی رد شد
fr: accès refusé
hu: hozzáférés megtagadva
id: akses ditolak
it: accesso negato
ja: アクセス拒否
ko: 액세스 거부
pl: odmowa dostępu
pt: acesso negado
ro: acces refuzat
ru: доступ запрещен
th: การเข้าถึงถูกปฏิเสธ
tr: erişim reddedildi
uk: доступ заборонено
vi: truy cập bị từ chối
zh_hans: 访问被拒绝
zh_hant: 存取被拒

# Find_Unreadable_Reason_IoError
source: I/O error
ar: خطأ في الإدخال/الإخراج
cs: vstupně-výstupní chyba
de: E/A-Fehler
el: σφάλμα I/O
es: error de E/S
fa: خطای ورودی/خروجی
fr: erreur d'E/S
hu: I/O-hiba
id: kesalahan I/O
it: errore di I/O
ja: I/O エラー
ko: I/O 오류
pl: błąd we/wy
pt: erro de E/S
ro: eroare I/O
ru: ошибка ввода-вывода
th: ข้อผิดพลาด I/O
tr: G/Ç hatası
uk: помилка введення-виведення
vi: lỗi I/O
zh_hans: I/O 错误
zh_hant: I/O 錯誤

# Find_Unreadable_Reason_Disconnected
source: device disconnected
ar: تم فصل الجهاز
cs: zařízení odpojeno
de: Gerät getrennt
el: η συσκευή αποσυνδέθηκε
es: dispositivo desconectado
fa: اتصال دستگاه قطع شد
fr: périphérique déconnecté
hu: az eszköz le lett választva
id: perangkat terputus
it: dispositivo disconnesso
ja: デバイスの取り外し
ko: 장치 연결 끊김
pl: urządzenie odłączone
pt: dispositivo desconectado
ro: dispozitiv deconectat
ru: устройство отключено
th: อุปกรณ์ถูกตัดการเชื่อมต่อ
tr: aygıtın bağlantısı kesildi
uk: пристрій від’єднано
vi: thiết bị đã bị ngắt kết nối
zh_hans: 设备已断开连接
zh_hant: 裝置已中斷連線

# Set_search_chunkSize
source: Search chunk size (KiB)
ar: حجم مقطع البحث (KiB)
cs: Velikost bloku hledání (KiB)
de: Blockgröße der Suche (KiB)
el: Μέγεθος τμήματος αναζήτησης (KiB)
es: Tamaño de bloque de búsqueda (KiB)
fa: اندازهٔ قطعهٔ جستجو (KiB)
fr: Taille des blocs de recherche (Kio)
hu: Keresési blokkméret (KiB)
id: Ukuran potongan pencarian (KiB)
it: Dimensione dei blocchi di ricerca (KiB)
ja: 検索のチャンクの大きさ (KiB)
ko: 검색 청크 크기(KiB)
pl: Rozmiar bloku wyszukiwania (KiB)
pt: Tamanho do bloco de pesquisa (KiB)
ro: Dimensiune bloc de căutare (KiB)
ru: Размер блока поиска (КиБ)
th: ขนาดชิ้นข้อมูลในการค้นหา (KiB)
tr: Arama parça boyutu (KiB)
uk: Розмір блоку пошуку (КіБ)
vi: Kích thước khối tìm kiếm (KiB)
zh_hans: 搜索块大小（KiB）
zh_hant: 搜尋區塊大小 (KiB)

# SetDesc_search_chunkSize
source: Size of the blocks read at a time while searching (256 KiB to 64 MiB). Results don't change.
ar: حجم الكتل التي تتم قراءتها في كل مرة أثناء البحث (من 256 KiB إلى 64 MiB). لا تتغير النتائج.
cs: Velikost bloků načítaných najednou při hledání (256 KiB až 64 MiB). Výsledky se nemění.
de: Größe der Blöcke, die bei der Suche auf einmal gelesen werden (256 KiB bis 64 MiB). Die Ergebnisse ändern sich nicht.
el: Μέγεθος των τμημάτων που διαβάζονται κάθε φορά κατά την αναζήτηση (256 KiB έως 64 MiB). Τα αποτελέσματα δεν αλλάζουν.
es: Tamaño de los bloques que se leen a la vez durante la búsqueda (de 256 KiB a 64 MiB). Los resultados no cambian.
fa: اندازهٔ بلوک‌هایی که هنگام جستجو هر بار خوانده می‌شوند (256 KiB تا 64 MiB). نتایج تغییر نمی‌کنند.
fr: Taille des blocs lus à la fois pendant la recherche (de 256 KiB à 64 MiB). Les résultats ne changent pas.
hu: A keresés közben egyszerre beolvasott blokkok mérete (256 KiB – 64 MiB). Az eredményeket nem befolyásolja.
id: Ukuran blok yang dibaca sekaligus saat mencari (256 KiB hingga 64 MiB). Hasil tidak berubah.
it: Dimensione dei blocchi letti alla volta durante la ricerca (da 256 KiB a 64 MiB). I risultati non cambiano.
ja: 検索で一度に読み込む大きさ (256 KiB〜64 MiB)。結果は変わりません。
ko: 검색할 때 한 번에 읽는 블록의 크기입니다(256 KiB~64 MiB). 결과는 바뀌지 않습니다.
pl: Rozmiar bloków odczytywanych naraz podczas wyszukiwania (od 256 KiB do 64 MiB). Wyniki się nie zmieniają.
pt: Tamanho dos blocos lidos por vez durante a pesquisa (256 KiB a 64 MiB). Os resultados não mudam.
ro: Dimensiunea blocurilor citite simultan în timpul căutării (de la 256 KiB la 64 MiB). Rezultatele nu se modifică.
ru: Размер блоков, считываемых за один раз при поиске (от 256 КиБ до 64 МиБ). На результаты не влияет.
th: ขนาดของบล็อกที่อ่านในแต่ละครั้งขณะค้นหา (256 KiB ถึง 64 MiB) ผลลัพธ์จะไม่เปลี่ยนแปลง
tr: Arama sırasında tek seferde okunan blokların boyutu (256 KiB ile 64 MiB arası). Sonuçları değiştirmez.
uk: Розмір блоків, що зчитуються за раз під час пошуку (від 256 КіБ до 64 МіБ). На результати не впливає.
vi: Kích thước khối đọc mỗi lần khi tìm kiếm (256 KiB đến 64 MiB). Kết quả không thay đổi.
zh_hans: 搜索时一次读取的块大小（256 KiB 到 64 MiB）。结果不会改变。
zh_hant: 搜尋時一次讀取的區塊大小（256 KiB 到 64 MiB）。結果不會改變。

# Set_search_readErrors
source: When data can't be read while searching
ar: عند تعذّر قراءة البيانات أثناء البحث
cs: Když data při hledání nelze přečíst
de: Wenn Daten bei der Suche nicht gelesen werden können
el: Όταν δεν είναι δυνατή η ανάγνωση δεδομένων κατά την αναζήτηση
es: Cuando no se pueden leer datos durante la búsqueda
fa: وقتی داده هنگام جستجو قابل خواندن نیست
fr: Lorsque des données ne peuvent pas être lues pendant la recherche
hu: Ha keresés közben adat nem olvasható
id: Saat data tidak dapat dibaca selama pencarian
it: Quando i dati non possono essere letti durante la ricerca
ja: 検索中に読み込めないデータがあったとき
ko: 검색 중 데이터를 읽을 수 없을 때
pl: Gdy podczas wyszukiwania nie można odczytać danych
pt: Quando os dados não podem ser lidos durante a pesquisa
ro: Când datele nu pot fi citite în timpul căutării
ru: Если при поиске не удается прочитать данные
th: เมื่ออ่านข้อมูลไม่ได้ขณะค้นหา
tr: Arama sırasında veri okunamadığında
uk: Якщо під час пошуку не вдається прочитати дані
vi: Khi không đọc được dữ liệu trong lúc tìm kiếm
zh_hans: 搜索时无法读取数据的处理方式
zh_hant: 搜尋時無法讀取資料的處理方式

# SetDesc_search_readErrors
source: What to do with unreadable data such as bad sectors. Skipped ranges are listed with the results.
ar: ما يجب فعله مع البيانات غير القابلة للقراءة مثل القطاعات التالفة. يتم سرد النطاقات المتخطاة مع النتائج.
cs: Co dělat s nečitelnými daty, například s vadnými sektory. Přeskočené rozsahy jsou uvedeny u výsledků.
de: Umgang mit nicht lesbaren Daten wie fehlerhaften Sektoren. Übersprungene Bereiche werden bei den Ergebnissen aufgeführt.
el: Τι γίνεται με δεδομένα που δεν διαβάζονται, όπως οι κατεστραμμένοι τομείς. Οι περιοχές που παραλείφθηκαν εμφανίζονται μαζί με τα αποτελέσματα.
es: Qué hacer con los datos ilegibles, como los sectores defectuosos. Los intervalos omitidos se indican con los resultados.
fa: با داده‌های غیرقابل خواندن مانند سکتورهای خراب چه شود. محدوده‌های ردشده همراه با نتایج فهرست می‌شوند.
fr: Que faire des données illisibles, comme les secteurs défectueux. Les plages ignorées sont listées avec les résultats.
hu: Mi történjen az olvashatatlan adatokkal, például hibás szektorokkal. A kihagyott tartományok az eredményekkel együtt jelennek meg.
id: Apa yang dilakukan terhadap data yang tidak dapat dibaca seperti sektor rusak. Rentang yang dilewati dicantumkan bersama hasil.
it: Cosa fare con i dati non leggibili, ad esempio settori danneggiati. Gli intervalli ignorati sono elencati con i risultati.
ja: 不良セクタなど読み込めないデータの扱い。飛ばした範囲は結果一覧に記録されます。
ko: 불량 섹터처럼 읽을 수 없는 데이터를 처리하는 방법입니다. 건너뛴 범위는 결과와 함께 표시됩니다.
pl: Co zrobić z nieczytelnymi danymi, np. uszkodzonymi sektorami. Pominięte zakresy są wymieniane razem z wynikami.
pt: O que fazer com dados ilegíveis, como setores defeituosos. Os intervalos ignorados são listados com os resultados.
ro: Ce se întâmplă cu datele care nu pot fi citite, cum ar fi sectoarele defecte. Intervalele omise sunt listate împreună cu rezultatele.
ru: Что делать с нечитаемыми данными, например поврежденными секторами. Пропущенные диапазоны перечисляются вместе с результатами.
th: สิ่งที่จะทำกับข้อมูลที่อ่านไม่ได้ เช่น เซกเตอร์เสีย ช่วงที่ข้ามจะแสดงอยู่ในผลลัพธ์
tr: Bozuk sektörler gibi okunamayan verilerle ne yapılacağı. Atlanan aralıklar sonuçlarla birlikte listelenir.
uk: Що робити з непрочитуваними даними, як-от пошкодженими секторами. Пропущені діапазони наводяться разом із результатами.
vi: Cách xử lý dữ liệu không đọc được như sector hỏng. Các phạm vi bị bỏ qua được liệt kê cùng với kết quả.
zh_hans: 如何处理坏扇区等无法读取的数据。跳过的范围会列在结果中。
zh_hant: 如何處理無法讀取的資料，例如損壞的磁區。略過的範圍會列在結果中。

# SetOpt_search_readErrors_ask
source: Ask
ar: السؤال
cs: Zeptat se
de: Nachfragen
el: Ερώτηση
es: Preguntar
fa: پرسیدن
fr: Demander
hu: Kérdés
id: Tanyakan
it: Chiedi
ja: 確認する
ko: 묻기
pl: Pytaj
pt: Perguntar
ro: Întrebare
ru: Спрашивать
th: ถาม
tr: Sor
uk: Запитувати
vi: Hỏi
zh_hans: 询问
zh_hant: 詢問
